In [1]:
import pandas as pd

In [1]:

df = pd.read_csv('C:/Users/USER/Documents/UCRLD2014/LD2011_2014.txt',low_memory=False,sep=';',index_col=0,parse_dates=True)

In [2]:
def convert_to_float(value):
    try:
        # Substituir vírgulas por pontos e converter para float
        return float(value.replace(',', '.'))
    except AttributeError:
        # Retornar o valor original se não for uma string
        return value
    except ValueError:
        # Retornar NaN se não for possível converter
        return np.nan

# Aplicar a função a cada coluna
df = df.apply(lambda col: col.map(convert_to_float) if col.dtype == 'object' else col)

In [3]:
df.isnull().sum()

MT_001    0
MT_002    0
MT_003    0
MT_004    0
MT_005    0
         ..
MT_366    0
MT_367    0
MT_368    0
MT_369    0
MT_370    0
Length: 370, dtype: int64

In [4]:
df.head()

,MT_001,MT_002,MT_003,MT_004,MT_005,MT_006,MT_007,MT_008,MT_009,MT_010,...,MT_361,MT_362,MT_363,MT_364,MT_365,MT_366,MT_367,MT_368,MT_369,MT_370
2011-01-01 00:15:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 00:30:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 00:45:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 01:00:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 01:15:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [5]:
df_hourly = df.resample('h').mean()

In [6]:
df.shape, df_hourly.shape

((140256, 370), (35065, 370))

In [7]:
df_hourly.head()

,MT_001,MT_002,MT_003,MT_004,MT_005,MT_006,MT_007,MT_008,MT_009,MT_010,...,MT_361,MT_362,MT_363,MT_364,MT_365,MT_366,MT_367,MT_368,MT_369,MT_370
2011-01-01 00:00:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 01:00:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 02:00:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 03:00:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2011-01-01 04:00:00,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [11]:

# Função para substituir zeros iniciais por NaN
import numpy as np
def replace_leading_zeros(column):
    is_leading = True
    result = []
    for value in column:
        if is_leading and value == 0:
            result.append(np.nan)
        else:
            is_leading = False
            result.append(value)
    return result

# Aplicar a função a cada coluna
df_hourly = df_hourly.apply(lambda col: replace_leading_zeros(col) if col.dtype in ['int64', 'float64'] else col)

In [12]:
df_hourly.isnull().sum()

MT_001     8760
MT_002     8760
MT_003     8760
MT_004     8760
MT_005     8760
          ...
MT_366     8760
MT_367     8760
MT_368     8760
MT_369     8760
MT_370    17544
Length: 370, dtype: int64

In [18]:
for col in df_hourly.columns:
    df_t = df_hourly[col]
    df_t.dropna(inplace=True)
    df_t.to_csv('lds/'+col+'.csv')

In [19]:
df_t

2013-01-01 00:00:00    6005.405405
2013-01-01 01:00:00    7848.648649
2013-01-01 02:00:00    7372.972973
2013-01-01 03:00:00    7789.189189
2013-01-01 04:00:00    7432.432432
                          ...
2014-12-31 20:00:00    8405.405405
2014-12-31 21:00:00    8283.783784
2014-12-31 22:00:00    7594.594595
2014-12-31 23:00:00    6932.432432
2015-01-01 00:00:00    7135.135135
Freq: h, Name: MT_370, Length: 17521, dtype: float64

Ammonia tratamento

In [11]:
import pandas as pd
df = pd.read_csv('ammonia.csv')
# Número de amostras
n = df.shape[0]  # Substitua por qualquer número desejado

# Data e hora de início
start_time = pd.Timestamp('2011-01-01 20:00:00')

# Gerar a série de tempo
date_times = pd.date_range(start=start_time, periods=n, freq='h')

df.set_index(date_times,inplace=True)

In [15]:
df.to_csv('ammonia.csv')

Distillate

In [2]:
import pandas as pd
df = pd.read_csv('distillate-flow.csv')
# Número de amostras
n = df.shape[0]  # Substitua por qualquer número desejado

# Data e hora de início
start_time = pd.Timestamp('2014-01-01 00:00:00')

# Gerar a série de tempo
date_times = pd.date_range(start=start_time, periods=n, freq='min')

df.set_index(date_times,inplace=True)

In [4]:
df.head()

                       Flow
2014-01-01 00:00:00  13.751
2014-01-01 00:01:00  13.751
2014-01-01 00:02:00  13.751
2014-01-01 00:03:00  13.751
2014-01-01 00:04:00  13.751

In [6]:
df.to_csv('distillate-flow.csv')

BIKE SHARING

In [8]:
df = pd.read_csv('Bike Sharing.csv')

df['datetime'] = pd.to_datetime(df['dteday'] + ' ' + df['hr'].astype(str) + ':00:00')
df.set_index('datetime',inplace=True)
df = df['cnt']

In [10]:
df.head()

datetime
2011-01-01 00:00:00    16
2011-01-01 01:00:00    40
2011-01-01 02:00:00    32
2011-01-01 03:00:00    13
2011-01-01 04:00:00     1
Name: cnt, dtype: int64

In [12]:
df.to_csv('Bike Sharing.csv')

Daily minimum

In [7]:
df = pd.read_csv('daily-minimum-temperatures-in-me.csv',sep=',',index_col=0,parse_dates=True)

# df['datetime'] = pd.to_datetime(df['dteday'] + ' ' + df['hr'].astype(str) + ':00:00')
# df.set_index('datetime',inplace=True)
# df = df['cnt']

In [9]:
df

           Daily minimum temperatures in Melbourne
Date
1981-01-01                                    20.7
1981-01-02                                    17.9
1981-01-03                                    18.8
1981-01-04                                    14.6
1981-01-05                                    15.8
...                                            ...
1990-12-27                                    14.0
1990-12-28                                    13.6
1990-12-29                                    13.5
1990-12-30                                    15.7
1990-12-31                                    13.0

[3650 rows x 1 columns]

Sunpots

In [11]:
df = pd.read_csv('Sunspots.txt.txt',sep=',',index_col=0,parse_dates=True)

In [15]:
df.to_csv('Sunspots.csv')